In [1]:
import pandas as pd, numpy as np, matplotlib.pyplot as plt, seaborn as sns

import warnings
warnings.filterwarnings("ignore")

%matplotlib inline

### 1. Obtaining Data

In [2]:
data = pd.read_csv("/workspaces/Projects/Marketing Analytics/data.csv")

In [3]:
data.shape

(185950, 15)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 15 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   customer_id       185950 non-null  int64
 1   product           185950 non-null  object
 2   quantity_ordered  185950 non-null  object
 3   price_each        185950 non-null  float64
 4   purchase_address  185950 non-null  object
 5   month             185950 non-null  int64
 6   year              185950 non-null  int64
 7   day               185950 non-null  int64
 8   city              185950 non-null  object
 9   code              185950 non-null  object
 10  sales             185950 non-null  float64
 11  order_date        185950 non-null  object
 12  hour              185950 non-null  int64
 13  minute            185950 non-null  int64
 14  count             185950 non-null  int64
dtypes: float64(2), int64(7), object(6)
memory usage: 21.3+ MB

In [3]:
data.head()

,MarketID,MarketSize,LocationID,AgeOfStore,Promotion,week,SalesInThousands
0,1,Medium,1,4,3,1,33.73
1,1,Medium,1,4,3,2,35.67
2,1,Medium,1,4,3,3,29.03
3,1,Medium,1,4,3,4,39.25
4,1,Medium,2,5,2,1,27.81

In [4]:
data.tail()

,MarketID,MarketSize,LocationID,AgeOfStore,Promotion,week,SalesInThousands
543,10,Large,919,2,1,4,64.34
544,10,Large,920,14,2,1,50.20
545,10,Large,920,14,2,2,45.75
546,10,Large,920,14,2,3,44.29
547,10,Large,920,14,2,4,49.41